#include <Arduino.h>  
#include <SoftwareSerial.h>  
#include <HardwareSerial.h>

#define HEAD_Serial Serial3
#define ROBOT_Serial Serial2
#define HMI_Serial Serial1

String comdata;              // 用于存储从串口接收到的数据
String inputData;            // 用于存储接收到的命令
int currentMode = 0;         // 当前模式，0: 无模式，1: Serial1，2: Serial2，3: Serial3，4: ATlight模式
bool skipLoopCheck = false;  // 控制是否跳过loop模式检查的标志
const int analogPin1 = A1;   // 定义A1引脚
const int analogPin2 = A2;   // 定义A2引脚
const int ElecPin = A15;     // 定义A2引脚
int lastLink1Value = -1;     // 用于存储上次读取的link1的状态，初始化为无效值
int lastLink2Value = -1;     // 用于存储上次读取的link2的状态，初始化为无效值
bool sendPicCommand = true;
uint8_t elecdata[] = {0x55, 0xE4, 0x01, 0xFF, 0xFF};
/***************************************************************************************************************************
****************************************************************************************************************************
******************************************************** 串口读取函数 *******************************************************
****************************************************************************************************************************
****************************************************************************************************************************/
void readFromSerial(Stream &serial, int mode) {
  // 当串口有数据时
  while (serial.available() > 0) {
    comdata += char(serial.read());  // 读取串口数据并保存到comdata中
    delay(2);                        // 添加延迟以确保数据读取完整
  }

  if (comdata.length() > 0) {  // 如果comdata有数据
    HMI_Serial.print("t3.txt=\"");
    HMI_Serial.print(comdata + "\"\xff\xff\xff"); 
    Serial.print(comdata + "\"\xff\xff\xff"); // 发送数据到Serial3串口设备
    comdata = "";                                  // 清空comdata，准备下一次接收
  }
}


/***************************************************************************************************************************
****************************************************************************************************************************
******************************************************** 串口输入处理函数 ***************************************************
****************************************************************************************************************************
****************************************************************************************************************************/
void handleInput() {
  // 检查Serial3串口是否有数据
  if (HMI_Serial.available() > 0) {
    inputData = HMI_Serial.readString();  // 读取串口数据
    inputData.trim();                     // 清除多余的空格和换行符


    if (inputData == "S") {              // 如果收到"S"指令
      skipLoopCheck = false;             // 关闭跳过loop模式检查的标志
      Serial.println("返回到loop模式");  // 打印调试信息
       if (currentMode == 6) {
        ROBOT_Serial.begin(9600); // 替换成你的波特率
        Serial.println("open");
      }
      currentMode = 0;                   // 切换回loop模式
    } else {
      // 根据当前模式，转发数据到相应的串口
      switch (currentMode) {
        case 1: ROBOT_Serial.print(inputData + "\n");Serial.print(inputData + "\n"); break;  // 如果模式为1，转发到Serial1
        case 2: HEAD_Serial.print(inputData + "\n"); Serial.print(inputData + "\n");break;   // 如果模式为2，转发到Serial2
        case 4:
          HEAD_Serial.print(inputData + "\n");
          ROBOT_Serial.print(inputData + "\n");
          break;  // 如果模式为2，转发到Serial2
      }
    }
    
  }
}


/***************************************************************************************************************************
****************************************************************************************************************************
**************************************************** 模式1：串口屏调试蓝牙1 **************************************************
****************************************************************************************************************************
****************************************************************************************************************************/
void ATserial1() {
  int link1Value = digitalRead(analogPin2);
  handleInput();                    // 处理输入
  readFromSerial(ROBOT_Serial, 1);  // 从Serial1读取数据并处理
  if (link1Value != lastLink1Value) {
    if (link1Value == HIGH) {
      HMI_Serial.print("p0.pic=1\xff\xff\xff");
    } else {
      HMI_Serial.print("p0.pic=2\xff\xff\xff");
    }
    lastLink1Value = link1Value;  // 更新link1的状态
  }
}


/***************************************************************************************************************************
****************************************************************************************************************************
*****************************************************  模式2：串口屏调试蓝牙2 ************************************************
****************************************************************************************************************************
****************************************************************************************************************************/
void ATserial2() {
  int link2Value = digitalRead(analogPin1);
  handleInput();                   // 处理输入
  readFromSerial(HEAD_Serial, 2);  // 从Serial2读取数据并处理
    // 只有当link2的状态发生变化时，才发送新命令
  if (link2Value != lastLink2Value) {
    if (link2Value == HIGH) {
      HMI_Serial.print("p0.pic=1\xff\xff\xff");
    } else {
      HMI_Serial.print("p0.pic=2\xff\xff\xff");
    }
    lastLink2Value = link2Value;  // 更新link2的状态
  }
}
/***************************************************************************************************************************
****************************************************************************************************************************
**************************************************** 模式3：蓝牙1与蓝牙2互传 *************************************************
****************************************************************************************************************************
****************************************************************************************************************************/
void ATserial3() {
  // 如果Serial1有数据
  while (ROBOT_Serial.available() > 0) {
    comdata += char(ROBOT_Serial.read());  // 读取串口数据并保存到comdata中
    delay(2);
  }                              // 添加延迟以确保数据读取完整
  if (comdata.length() > 0) {    // 如果comdata有数据
    HEAD_Serial.print(comdata);  // 将数据转发到Serial2
    Serial.print(comdata);       // 将数据转发到Serial2
    HMI_Serial.print("t3.txt=\"");
    HMI_Serial.print(comdata + "\"\xff\xff\xff");  // 发送数据到Serial3串口设备
    comdata = "";
  }

  // 如果Serial2有数据
  while (HEAD_Serial.available() > 0) {
    comdata += char(HEAD_Serial.read());  // 读取串口数据并保存到comdata中
    delay(2);
  }                               // 添加延迟以确保数据读取完整
  if (comdata.length() > 0) {     // 如果comdata有数据
    ROBOT_Serial.print(comdata);  // 将数据转发到Serial1
    Serial.print(comdata);        // 将数据转发到Serial2
    HMI_Serial.print("t3.txt=\"");
    HMI_Serial.print(comdata + "\"\xff\xff\xff");  // 发送数据到Serial3串口设备
    comdata = "";
  }

  // 如果Serial3有数据
  if (HMI_Serial.available() > 0) {
    inputData = HMI_Serial.readString();  // 读取Serial3的数据
    inputData.trim();                     // 清除空格和换行符

    if (inputData == "S") {              // 如果收到"S"指令
      Serial.println("返回到loop模式");  // 打印调试信息
      skipLoopCheck = false;             // 关闭跳过loop检查的标志
      currentMode = 0;                   // 切换回loop模式
    }
  }
}
/***************************************************************************************************************************
****************************************************************************************************************************
**************************************************** 模式4：串口屏调试模式 ***************************************************
****************************************************************************************************************************
****************************************************************************************************************************/
void ATserial4() {
  handleInput();
  while (Serial.available() > 0) {
    comdata += char(Serial.read());  // 读取串口数据并保存到comdata中
    delay(2);
  }                            // 添加延迟以确保数据读取完整
  if (comdata.length() > 0) {  // 如果comdata有数据
    ROBOT_Serial.print(comdata);
    HEAD_Serial.print(comdata);
    HMI_Serial.print(comdata);
    comdata = "";
  }
}

/***************************************************************************************************************************
****************************************************************************************************************************
**************************************************** 模式5：电量检测函数 *****************************************************
****************************************************************************************************************************
****************************************************************************************************************************/
void Batt1_void() {
  float voltage1 = analogRead(ElecPin) * (5.1/ 1024) * 2;
  HMI_Serial.print("t0.txt=\"");
  HMI_Serial.print(voltage1, 2);
  HMI_Serial.print("\"\xff\xff\xff");
}
void Batt2_void() {
  ROBOT_Serial.write(elecdata, sizeof(elecdata));
  while (ROBOT_Serial.available() > 0) {
    comdata += char(ROBOT_Serial.read());  // 读取串口数据并保存到comdata中
    delay(2);
  }                              // 添加延迟以确保数据读取完整
  if (comdata.length() > 0) {    // 如果comdata有数据
    HMI_Serial.print("t1.txt=\"");
    HMI_Serial.print(comdata + "\"\xff\xff\xff");  // 发送数据到Serial3串口设备
    comdata = "";
    Serial.print(comdata);
  }
}
void Batt3_void() {
  HEAD_Serial.print("K");
  while (HEAD_Serial.available() > 0) {
    comdata += char(HEAD_Serial.read());  // 读取串口数据并保存到comdata中
    delay(2);
  }                              // 添加延迟以确保数据读取完整
  if (comdata.length() > 0) {    // 如果comdata有数据
    HMI_Serial.print("t2.txt=\"");
    HMI_Serial.print(comdata + "\"\xff\xff\xff");  // 发送数据到Serial3串口设备
    comdata = "";
  }
}
void ATserial5() {
  if (HMI_Serial.available() > 0) {
    inputData = HMI_Serial.readString();  // 读取串口数据
    inputData.trim();                     // 清除多余的空格和换行符


    if (inputData == "S") {
      Serial.println("返回到loop模式");  // 打印调试信息
      skipLoopCheck = false;             // 关闭跳过loop检查的标志
      currentMode = 0;                   // 切换回loop模式
    } else if (inputData == "P") {
      for (int i = 0; i < 500; i++){Batt1_void();delay(10);}
    } else if (inputData == "J") {
    Batt2_void();
    } else if (inputData == "T") {
     Batt3_void();
    }
  }
}

/***************************************************************************************************************************
****************************************************************************************************************************
**************************************************** 模式6：编程模式 *****************************************************
****************************************************************************************************************************
****************************************************************************************************************************/
void ATserial6() {
ROBOT_Serial.end(); // 关闭串口
Serial.println("off");
handleInput();
}
/***************************************************************************************************************************
****************************************************************************************************************************
******************************************************** 配置函数 ***********************************************************
****************************************************************************************************************************
****************************************************************************************************************************/
void setup() {
  // 初始化串口通信，设置波特率为9600
  ROBOT_Serial.begin(9600);
  HEAD_Serial.begin(9600);
  HMI_Serial.begin(9600);
  Serial.begin(9600);          // 初始化主串口
  pinMode(analogPin2, INPUT);  // 设置A2为输入模式
  pinMode(analogPin1, INPUT);  // 设置A1为输入模式
}
/***************************************************************************************************************************
****************************************************************************************************************************
******************************************************** 主函数 *************************************************************
****************************************************************************************************************************
****************************************************************************************************************************/
void loop() {
  if (!skipLoopCheck) {  // 仅在不跳过检查时执行
    // 检查Serial3是否有数据
    if (HMI_Serial.available() > 0) {
      char command = HMI_Serial.read();
      switch (command) {
        case '1':
          currentMode = 1;
          Serial.print("mode:1");
          skipLoopCheck = true;
          break;
        case '2':
          currentMode = 2;
          Serial.print("mode:2");
          skipLoopCheck = true;
          break;
        case '3':
          currentMode = 3;
          Serial.print("mode:3");
          skipLoopCheck = true;
          break;
        case '4':
          currentMode = 4;
          Serial.print("mode:4");
          skipLoopCheck = true;
          break;
        case '5':
          currentMode = 5;
          Serial.print("mode:5");
          skipLoopCheck = true;
          break;
        case '6':
          currentMode = 6;
          Serial.print("mode:6");
          skipLoopCheck = true;
          break;
      }
    }
  }

  // 根据当前模式，调用对应的串口操作函数
  switch (currentMode) {
    case 1: ATserial1(); break;
    case 2: ATserial2(); break;
    case 3: ATserial3(); break;
    case 4: ATserial4(); break;
    case 5: ATserial5(); break;
    case 6: ATserial6(); break;
  }
}
